[
  {
    "title": "Process Scheduling Simulation",
    "tech": "CPU Scheduling, Process Management, C, Data Structures (Linked Lists), Unix Utilities",
    "bulletPoints": [
      "Engineered a CPU Scheduler Simulation in C, implementing FIFO, SJF, and Round Robin algorithms with preemption handling using linked list-based job queues.",
      "Analyzed scheduling algorithm efficiency by measuring response, turnaround, and wait times across five custom workload scenarios.",
      "Optimized Round Robin performance through time slice execution and job preemption to balance fairness and computational efficiency."
    ]
  },
  {
    "title": "Virtual Memory Manager Simulation",
    "tech": "Operating Systems Concepts (Paging, Virtual Memory), C, Memory Management",
    "bulletPoints": [
      "Simulated a Virtual Memory Manager in C, implementing page tables, address translation, and process isolation to efficiently manage memory.",
      "Designed a dynamic page replacement strategy to handle memory capacity and optimize page swapping to disk.",
      "Ensured robust memory access by supporting mapping, loading, and storing operations with proper read/write permissions and error handling."
    ]
  },
  {
    "title": "Exploring Linux OS Fundamentals",
    "tech": "Process Management (fork, waitpid), Linux System Calls, C",
    "bulletPoints": [
      "Implemented fork-based process creation and management in Linux, tracking and synchronizing multiple child processes.",
      "Designed a dynamic file system explorer utilizing Linux system calls (execvp, chdir, getcwd) for command execution and directory navigation.",
      "Developed multi-process simulations, including a Slug Race, to demonstrate parallel execution and process timing while ensuring portability with Makefiles."
    ]
  },
  {
    "title": "Web Application for Student Assistant Application Process",
    "tech": "Flask, PostgreSQL, Azure SSO, HTML/CSS, Agile, AWS",
    "bulletPoints": [
      "Led development of a full-stack web application for WPI's CS Department, streamlining student assistant applications for hundreds of users.",
      "Integrated Azure Single Sign-On (SSO) for secure authentication and built a personalized recommendation algorithm for SA opportunities.",
      "Utilized Flask for backend development, PostgreSQL for database management, and responsive HTML/CSS for intuitive user interfaces, following Agile practices."
    ]
  },
  {
    "title": "Machine Learning-Based Facial Expression Recognition Project",
    "tech": "Deep Learning, Computer Vision, Python, PyTorch, NumPy, Scikit-learn",
    "bulletPoints": [
      "Designed and optimized a 4-layer Convolutional Neural Network (CNN) in PyTorch for facial expression recognition on the FER2013 dataset, achieving ~57% accuracy.",
      "Enhanced model performance through hyperparameter tuning with AdamW optimizer, learning rate scheduling, and batch normalization.",
      "Conducted comprehensive analysis using confusion matrices, accuracy plots, and misclassified image visualizations to evaluate model reliability."
    ]
  },
  {
    "title": "Multithreaded Sports Field Synchronization",
    "tech": "Multi-Threading, Concurrency Control, Mutexes, Semaphores, C",
    "bulletPoints": [
      "Developed a multi-threaded synchronization system for Worcester Gompei Park, managing concurrent sports games using mutexes, condition variables, and semaphores.",
      "Implemented fair scheduling and concurrency control to prevent thread starvation across baseball, football, and rugby teams on a shared resource.",
      "Conducted extensive stress testing with randomized simulations and seed-based reproducibility to verify synchronization correctness and resource allocation."
    ]
  }
]