[
  {
    "title": "Web Application for Student Assistant Application Process",
    "tech": "Flask/PostgreSQL/Microsoft Azure/Amazon Web Services/HTML5/CSS3",
    "bulletPoints": [
      "Developed a full-stack web application to streamline WPI's Student Assistant (SA) application process.",
      "Created intuitive student interfaces with a personalized recommendation algorithm and instructor tools for SA management.",
      "Integrated Azure SSO and utilized Flask, PostgreSQL, HTML/CSS for a scalable and secure solution."
    ],
    "repoUrl": null,
    "liveUrl": null
  },
  {
    "title": "Machine Learning-Based Facial Expression Recognition Project",
    "tech": "Python/PyTorch/NumPy/Matplotlib/Scikit-learn",
    "bulletPoints": [
      "Designed and optimized a 4-layer Convolutional Neural Network (CNN) achieving ~57% accuracy on the FER2013 dataset.",
      "Experimented with AdamW optimizer, learning rate scheduling, and batch normalization for performance tuning.",
      "Utilized confusion matrices and visualizations for model evaluation and analysis."
    ],
    "repoUrl": null,
    "liveUrl": null
  },
  {
    "title": "AI-Driven Reversi Game",
    "tech": "Java/Artificial Intelligence/Game Theory/Object-Oriented Programming",
    "bulletPoints": [
      "Developed an AI-powered Reversi game in Java with intelligent move validation and dynamic piece-flipping.",
      "Engineered a strategic AI prioritizing optimal board positions (e.g., corners) for maximum advantage.",
      "Implemented real-time input handling and automated winner calculation for a smooth gameplay experience."
    ],
    "repoUrl": "https://github.com/adityaapatel/APCSA",
    "liveUrl": null
  },
  {
    "title": "Game Playing AI – Lasker Morris",
    "tech": "Artificial Intelligence/Adversarial Search",
    "bulletPoints": [
      "Developed an AI agent for Lasker Morris using minimax search with alpha-beta pruning.",
      "Implemented heuristic evaluation functions and progressive deepening for strategic gameplay.",
      "Ensured compatibility with the CS4341 Referee system for game interaction protocols."
    ],
    "repoUrl": null,
    "liveUrl": null
  },
  {
    "title": "Process Scheduling Simulation",
    "tech": "C/Operating Systems/Data Structures",
    "bulletPoints": [
      "Developed a CPU scheduler simulation implementing FIFO, SJF, and Round Robin algorithms.",
      "Analyzed performance metrics (response, turnaround, wait time) for various custom workloads.",
      "Built a Makefile-based C program with automated testing using Unix utilities."
    ],
    "repoUrl": null,
    "liveUrl": null
  },
  {
    "title": "Virtual Memory Manager Simulation",
    "tech": "C/Operating Systems/Memory Management",
    "bulletPoints": [
      "Implemented a virtual memory manager simulating paging and swapping mechanisms for efficient memory handling.",
      "Designed a page replacement strategy for dynamic allocation and swapping to disk.",
      "Supported mapping, loading, storing operations with error handling and optimized data structures."
    ],
    "repoUrl": null,
    "liveUrl": null
  }
]